<a href="https://colab.research.google.com/github/Moin199/WebScarping/blob/master/Wikipedia_Scraping.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#Importing rlevant libraries
from bs4 import BeautifulSoup
import pandas as pd
import urllib

In [0]:
from urllib.request import urlopen
#Fetching the webpage
page = urlopen('https://en.wikipedia.org/wiki/List_of_universities_in_England')
#creating the Beautiful Soup object
soup = BeautifulSoup(page, 'html.parser')

In [0]:
'''Function to fecth the details of the individual university 
that we get from the page variable.
Logic is to add the name of the URL for university behind the root webpage
Returns Former Name,No. of students,Undrgraduates and Post Graduates'''
def fetchUniDetails(web_page):
    prefix="https://en.wikipedia.org"

    page2 = urlopen(prefix+web_page)
    soup2 = BeautifulSoup(page2, 'html.parser')
    uni_details=[None,None,None,None]
    
    
    table=soup2.find('table', class_='infobox vcard')
    try:
      for row in table.tbody.findAll('tr'):              
        if row.find(text=True)=='Former names' or row.find(text=True)=='Former name':
          if row.td.find(text=True)!='See History':
            uni_details[0]=row.td.find(text=True)

        if row.find(text=True)=='Students':
          uni_details[1]=row.td.find(text=True)

        if row.find(text=True)=='Undergraduates':
          uni_details[2]=row.td.find(text=True)
          
        if row.find(text=True)=='Postgraduates':
          uni_details[3]=row.td.find(text=True)

    except:
        pass
    return uni_details

In [0]:
university=[]
location=[]
students=[]
former_names=[]
undergraduates=[]
postgraduates=[]
established=[]
'''getting the complete data of the table
'''
right_table=soup.find('table', class_='wikitable sortable')
for row in right_table.findAll('tr'):
    cells=row.findAll('td')
    if len(cells)==6:
        university.append(cells[0].find(text=True))
        uni_url=cells[0].find('a',href=True)['href']
        location.append(cells[1].find(text=True))        
        established.append(cells[2].find(text=True))
        
        uni_details = fetchUniDetails(uni_url)
        former_names.append(uni_details[0] )
        if uni_details[1] is not None:
          students.append(uni_details[1])
        else:
          students.append(cells[3].find(text=True))
        undergraduates.append(uni_details[2])
        postgraduates.append(uni_details[3]  )

In [0]:
#Filling up the fields of the Dataframe
df=pd.DataFrame(university,columns=['university'])
df['former names']=former_names
df['students']=students
df['location']=location
df['undergraduates']=undergraduates
df['postgraduates']=postgraduates
df['established']=established
df.head()

                      university  ...    established
0        AECC University College  ...     – (1965)\n
1       Anglia Ruskin University  ...  1992 (1858)\n
2               Arden University  ...  2015 (1990)\n
3    Arts University Bournemouth  ...  2012 (1885)\n
4  University of the Arts London  ...         2004\n

[5 rows x 7 columns]

In [0]:
df.tail()

                      university former names  ... postgraduates  established
125  University of Wolverhampton  Unavailable  ...         3,635  1992 (1969)
126      University of Worcester  Unavailable  ...         1,665         1997
127   Writtle University College  Unavailable  ...   Unavailable     – (1893)
128           University of York  Unavailable  ...         5,435         1963
129      York St John University  Unavailable  ...           790  2006 (1841)

[5 rows x 7 columns]

In [0]:
#Dataframe details
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130 entries, 0 to 129
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   university      130 non-null    object
 1   former names    43 non-null     object
 2   students        130 non-null    object
 3   location        130 non-null    object
 4   undergraduates  120 non-null    object
 5   postgraduates   121 non-null    object
 6   established     130 non-null    object
dtypes: object(7)
memory usage: 7.2+ KB

In [0]:
df[df['postgraduates'].isnull()]

                                  university  ...    established
2                           Arden University  ...  2015 (1990)\n
15                            BPP University  ...  2013 (1992)\n
28                      Cranfield University  ...  1993 (1946)\n
38   University College of Estate Management  ...     – (1919)\n
41             University of Gloucestershire  ...  2001 (1998)\n
44                       Hartpury University  ...  2018 (1947)\n
82     London Institute of Banking & Finance  ...     – (1879)\n
104               Regent's University London  ...  2013 (1984)\n
127               Writtle University College  ...     – (1893)\n

[9 rows x 7 columns]

In [0]:
df.fillna('Unavailable', inplace=True)

In [0]:
for col in ['students','undergraduates','postgraduates']:
  df[col]=df[col].apply(lambda x: x.split(' ')[0])
  df[col]=df[col].apply(lambda x: x.replace('-','na'))

for col in ['established','students','location']:
  df[col]=df[col].apply(lambda x: x.replace('\n',''))

In [0]:
df.head()

                      university  ...  established
0        AECC University College  ...     – (1965)
1       Anglia Ruskin University  ...  1992 (1858)
2               Arden University  ...  2015 (1990)
3    Arts University Bournemouth  ...  2012 (1885)
4  University of the Arts London  ...         2004

[5 rows x 7 columns]

In [0]:
import sqlite3

In [0]:
conn = sqlite3.connect('Wiki.db')

In [0]:
c = conn.cursor()

In [0]:
c.execute('CREATE TABLE University (university, former names,students,location,undergraduates,postgraduates,established)')
conn.commit()

In [0]:
df.to_sql('University',conn,if_exists='replace',index=False)

/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:2663: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [0]:
while(True):
  name=input('Enter the name of University')
  former_name=input('Enter the former name of University')
  print(c.execute('SELECT * FROM University where university=?',(name,)).fetchall())
  exit_status=input('Do you want to exit? Y or N')
  if exit_status.lower()=='y':
    break

Enter the name of UniversityUniversity of the Arts London
Enter the former name of UniversityLondon Institute
[('University of the Arts London', 'London Institute', '18,290', 'London', '14,760', '3,530', '2004')]
Do you want to exit? Y or Nn
Enter the name of UniversityUniversity of the Arts London
Enter the former name of UniversityLondon Institute
[('University of the Arts London', 'London Institute', '18,290', 'London', '14,760', '3,530', '2004')]
Do you want to exit? Y or Ny